/*
// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// Вводим переменные 
int num1;

int num2;

// Просим пользователя ввести числа 
Console.Write("Введите первое число : ");
num1 = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите второе число: ");
num2 = Convert.ToInt32(Console.ReadLine());

// Сравниваем числа, выводим наибольшее на консоль 
if (num1 > num2){
    Console.WriteLine("Максимальное число " + num1); 
}
else
{
    Console.WriteLine("Максимальное число " + num2); 
}
*/

/*
//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// Вводим переменные 
int num1;

int num2;

int num3;
//Добовляем переменную макс 
int max;

// Просим пользователя ввести числа 
Console.Write("Введите первое число : ");
num1 = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите второе число: ");
num2 = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите третье число: ");
num3 = Convert.ToInt32(Console.ReadLine());

// Сравниваем 1и 2  число, запоминаем максимальное
if (num1 > num2){
    max = num1;
}
else
    max = num2;

// Сравниваем максимальное с 3 числов, выводим максимальное на консоль 
if (num3 > max){
    max = num3;
    Console.WriteLine("Максимальное число " + max);
}
else
    Console.WriteLine("Максимальное число " + max);
*/


