/*
// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// Вводим переменные 
int num1;

int num2;

// Просим ввести числа 
Console.Write("Введите первое число : ");
num1 = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите второе число: ");
num2 = Convert.ToInt32(Console.ReadLine());

// Сравниваем числа, выводим наибольшее на консоль 
if (num1 > num2){
    Console.WriteLine("Максимальное число " + num1); 
}
else
{
    Console.WriteLine("Максимальное число " + num2); 
}
*/

